---
title: SymbolicCurveArray
classe: Autodesk.Revit.DB.SymbolicCurveArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# SymbolicCurveArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `symbolicCurveArray.IsEmpty` | Boolean |
| `SymbolicCurve Item { get; set; }` | `symbolicCurveArray.Item` | SymbolicCurve |
| `Int32 Size { get; }` | `symbolicCurveArray.Size` | Int32 |
| `Void Append(SymbolicCurve)` | `symbolicCurveArray.Append(item)` | Void |
| `Void Clear()` | `symbolicCurveArray.Clear()` | Void |
| `SymbolicCurveArrayIterator ForwardIterator()` | `symbolicCurveArray.ForwardIterator()` | SymbolicCurveArrayIterator |
| `IEnumerator GetEnumerator()` | `symbolicCurveArray.GetEnumerator()` | IEnumerator |
| `Void Insert(SymbolicCurve, Int32)` | `symbolicCurveArray.Insert(item, index)` | Void |
| `SymbolicCurveArrayIterator ReverseIterator()` | `symbolicCurveArray.ReverseIterator()` | SymbolicCurveArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```